In [2]:
import numpy as np
from statistics import *
x = np.array([7,8,9])
y= np.array([9,10,20])

print(y.mean ())
print(np.cov(x))
print(np.corrcoef(x,y))
np.corrcoef(x,y)

13.0
1.0
[[1.         0.90419443]
 [0.90419443 1.        ]]

array([[1.        , 0.90419443],
       [0.90419443, 1.        ]])

In [10]:
arr = np.array(np.arange(1,26)).reshape(5,5)
print(arr.cumsum(0)) # 행끼리 누적합 밑으로 합을 내려감
print(arr.cumsum(1)) # 열끼리 누적합 옆으로 합을 내려감
print(arr.cumsum()) # 전체 누적
# sum, mean, cumsum, 등 매개변수로 axis를 같는다 내가  정하고싶은대로 하면됨

[[ 1  2  3  4  5]
 [ 7  9 11 13 15]
 [18 21 24 27 30]
 [34 38 42 46 50]
 [55 60 65 70 75]]
[[  1   3   6  10  15]
 [  6  13  21  30  40]
 [ 11  23  36  50  65]
 [ 16  33  51  70  90]
 [ 21  43  66  90 115]]
[  1   3   6  10  15  21  28  36  45  55  66  78  91 105 120 136 153 171
 190 210 231 253 276 300 325]

array([55, 60, 65, 70, 75])

In [104]:
import pandas as pd
import numpy as np
data={'a':0,'b':1,'c':2}
print(data)
s=pd.Series(data, index=['b','c','d','a'])
print(s)

{'a': 0, 'b': 1, 'c': 2}
b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [42]:
type(s)
t = list(s)
type(t)

list

In [89]:
t = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(t)
print(t[2:4])
print(data.items()) # dict 형태의 안에 데이터를 전부가져올때는 items(),
print(data.keys()) # key 값만 가져올때
print(data.values()) # value 값만 가져올때
data.get('a')
print('*'*30)
t['f'] = 6
print(t)
print('*'*30)
# filltering
print(t[t>3])
print(t*2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
c    3
d    4
dtype: int64
dict_items([('a', 0), ('b', 1), ('c', 2)])
dict_keys(['a', 'b', 'c'])
dict_values([0, 1, 2])
******************************
a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64
******************************
d    4
e    5
f    6
dtype: int64
a     2
b     4
c     6
d     8
e    10
f    12
dtype: int64

In [134]:
data = np.array(['a','b','c','d'])
data2={'a':0,'b':1,'c':2}
print(data)
s = pd.Series(data)
print(s)
print('*'*30)
print(s.dtype) # dtypes?
# print(dir(s))
print(s.index)
list(s.index) # s의 index를 list로 
print(t.index) # Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')
list(t.index) # t 의 index를 list
print(s[0])
print(s.head())
print(s.value_counts())
print(s.value_counts(normalize=True))# 비율 전체 합은 1로 => 상대도수 분포표
print('*'*30)
print(s.describe)
print(s.describe()) # top : 가장 많이 나온 value, freq : top의 개수

['a' 'b' 'c' 'd']
0    a
1    b
2    c
3    d
dtype: object
******************************
object
RangeIndex(start=0, stop=4, step=1)
Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')
a
0    a
1    b
2    c
3    d
dtype: object
d    1
a    1
b    1
c    1
dtype: int64
d    0.25
a    0.25
b    0.25
c    0.25
dtype: float64
******************************
<bound method NDFrame.describe of 0    a
1    b
2    c
3    d
dtype: object>
count     4
unique    4
top       d
freq      1
dtype: object

In [154]:
print(s.dtypes)
s.ndim
s.shape

object

(4,)

In [168]:
t =np.arange(5)
a = list(range(5))
print(type(t))
print(type(a))
print(list(a))

<class 'numpy.ndarray'>
<class 'list'>
[0, 1, 2, 3, 4]

In [190]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
print(sdata)
print(type(sdata))
dd = pd.Series(sdata)
print(dd)
print(type(dd))
print('*'*30)
states = ['California','Ohio','Oregon','Texas']
print(states)
print(type(states))
dd2 = pd.Series(sdata,index=states)
print(dd2)
print(type(dd2))

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
<class 'dict'>
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
<class 'pandas.core.series.Series'>
******************************
['California', 'Ohio', 'Oregon', 'Texas']
<class 'list'>
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
<class 'pandas.core.series.Series'>

In [191]:
print(dd.index)
print(dd2.index)
print(pd.isnull(dd)) # null이 맞나 ?
print(pd.notnull(dd)) # null이 아닌가?

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')
Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')
Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool
Ohio      True
Texas     True
Oregon    True
Utah      True
dtype: bool

In [192]:
dd+dd2

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [194]:
s = pd.Series(['A','B','Aaba','Baca',np.nan,'CABA','cat'])
s.str.count('A')

0    1.0
1    0.0
2    1.0
3    0.0
4    NaN
5    2.0
6    0.0
dtype: float64

In [233]:
import pandas as pd
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
print(area)
print(type(area))
print(area.dtype)
print()
print(pop)

data = pd.DataFrame({'area':area,'pop':pop})
print(data)
data

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64
<class 'pandas.core.series.Series'>
int64

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64
              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [234]:
print(data['area'])
print(data.area)
print(data.area.values)
print(data.area.index)

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64
California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64
[423967 695662 141297 170312 149995]
Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [235]:
print(sum(data.area.values))
print('*'*30)
print(data.sum(0))
print()
print(data.sum(1))
print()
print(data.sum())
print('*'*30)
print(data.mean(1))
print('*'*30)
data.area is data.area == 423967
data.area is data.area
data.area is data['area']

1581233
******************************
area      1581233
pop     116866836
dtype: int64

California    38756488
Texas         27143855
New York      19792424
Florida       19723172
Illinois      13032130
dtype: int64

area      1581233
pop     116866836
dtype: int64
******************************
California    19378244.0
Texas         13571927.5
New York       9896212.0
Florida        9861586.0
Illinois       6516065.0
dtype: float64
******************************

True

In [247]:
data['density']=data['pop']/data['area']
data
# data['density'] = data.pop / data.area  이건 안됨 이유모름

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [256]:
print(data.index)
print(data.values)

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')
[[4.23967000e+05 3.83325210e+07 9.04139261e+01]
 [6.95662000e+05 2.64481930e+07 3.80187404e+01]
 [1.41297000e+05 1.96511270e+07 1.39076746e+02]
 [1.70312000e+05 1.95528600e+07 1.14806121e+02]
 [1.49995000e+05 1.28821350e+07 8.58837628e+01]]

In [257]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [259]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

## pandas dataframe에서 인덱싱

In [264]:
print(data.iloc[0,0])
print(data.iloc[:2][:])

423967
              area       pop    density
California  423967  38332521  90.413926
Texas       695662  26448193  38.018740

In [273]:
print(data['California' : 'Florida'])
print()
print(data['Texas':'California'])
# indax 순서를 맞춰서 해줘야함
data.index

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121

Empty DataFrame
Columns: [area, pop, density]
Index: []

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [325]:
import pandas as pd
import numpy as np

d = {'Name':pd.Series(['김하나','이하나','삼하나','사하나','오하나','육하나','칠하나', '팔하나']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

In [326]:
df = pd.DataFrame(d)
print(df.axes) # index와 columns
print(df.index) # index
print(df.columns) # columns 가로 인덱스?

[RangeIndex(start=0, stop=8, step=1), Index(['Name', 'Age', 'Rating'], dtype='object')]
RangeIndex(start=0, stop=8, step=1)
Index(['Name', 'Age', 'Rating'], dtype='object')

In [327]:
print(df.ndim)
print(df.shape)
print(df.size)
print(df.values)

2
(8, 3)
24
[['김하나' 25.0 4.23]
 ['이하나' 26.0 3.24]
 ['삼하나' 25.0 3.98]
 ['사하나' 23.0 2.56]
 ['오하나' 30.0 3.2]
 ['육하나' 29.0 4.6]
 ['칠하나' 23.0 3.8]
 ['팔하나' nan nan]]

In [328]:
print(df.head(2))
print(df.tail(2))

  Name   Age  Rating
0  김하나  25.0    4.23
1  이하나  26.0    3.24
  Name   Age  Rating
6  칠하나  23.0     3.8
7  팔하나   NaN     NaN

In [338]:
print(df.sum())
print('name을 빼고 인덱싱 해서')
print(df.iloc[:,[1,2]].sum())
print()
print(df.std())
print()
print(df.mean(1)) # default = 0
print(df.mean())

Name      김하나이하나삼하나사하나오하나육하나칠하나팔하나
Age                            181
Rating                       25.61
dtype: object
name을 빼고 인덱싱 해서
Age       181.00
Rating     25.61
dtype: float64

Age       2.734262
Rating    0.698628
dtype: float64

0    14.615
1    14.620
2    14.490
3    12.780
4    16.600
5    16.800
6    13.400
7       NaN
dtype: float64
Age       25.857143
Rating     3.658571
dtype: float64

In [343]:
print(df.describe())
print(df.median())

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000
Age       25.0
Rating     3.8
dtype: float64

In [345]:
print(df.describe(include=['object']))
print()
print(df.describe(include='all'))

       Name
count     8
unique    8
top     사하나
freq      1

       Name        Age    Rating
count     8   7.000000  7.000000
unique    8        NaN       NaN
top     사하나        NaN       NaN
freq      1        NaN       NaN
mean    NaN  25.857143  3.658571
std     NaN   2.734262  0.698628
min     NaN  23.000000  2.560000
25%     NaN  24.000000  3.220000
50%     NaN  25.000000  3.800000
75%     NaN  27.500000  4.105000
max     NaN  30.000000  4.600000

In [346]:
data={'state': ['경기', '강원', '서울', '충북', '인천'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}

frame2=pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                 index=['one', 'two', 'three', 'four', 'five']) 
frame2

       year state  pop debt
one    2000    경기  1.5  NaN
two    2001    강원  1.7  NaN
three  2002    서울  3.6  NaN
four   2001    충북  2.4  NaN
five   2002    인천  2.9  NaN

In [348]:
print(frame2.state)

one      경기
two      강원
three    서울
four     충북
five     인천
Name: state, dtype: object

In [349]:
frame2.debt = 16.5
print(frame2)

       year state  pop  debt
one    2000    경기  1.5  16.5
two    2001    강원  1.7  16.5
three  2002    서울  3.6  16.5
four   2001    충북  2.4  16.5
five   2002    인천  2.9  16.5

In [351]:
frame2.debt = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])
print(frame2)
frame2

       year state  pop  debt
one    2000    경기  1.5   NaN
two    2001    강원  1.7  -1.2
three  2002    서울  3.6   NaN
four   2001    충북  2.4  -1.5
five   2002    인천  2.9  -1.7

       year state  pop  debt
one    2000    경기  1.5   NaN
two    2001    강원  1.7  -1.2
three  2002    서울  3.6   NaN
four   2001    충북  2.4  -1.5
five   2002    인천  2.9  -1.7

In [353]:
frame2['estern'] = frame2.state == '서울'
frame2

       year state  pop  debt  estern
one    2000    경기  1.5   NaN   False
two    2001    강원  1.7  -1.2   False
three  2002    서울  3.6   NaN    True
four   2001    충북  2.4  -1.5   False
five   2002    인천  2.9  -1.7   False

## iloc[] : 숫자형으로 인덱싱
## loc[] : 문자형으로 인덱싱

In [358]:
print(frame2['year']['one']) # 열,행
print(frame2.loc['one','year']) # 행,열

2000
2000

In [361]:
data = {'지역' : ['수도권','경상권','수도권','경상권'],
           '2018' : [9904312,3448737,2890451,2466052],
           '2017' : [9631482,3393191,2632035,2431774],
           '2016' : [9762546,3512547,2517680,2456016],
           '2015' : [9853972,3655437,2466338,2473990],
           '2015-2018 증가율' : [0.0283,0.0163,0.0982,0.0141]}
frame = pd.DataFrame(data,columns = ['지역','2015','2016','2017','2018','2015-2018 증가율']
                     ,index = ['서울','부산','인천','데구'])
frame

     지역     2015     2016     2017     2018  2015-2018 증가율
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
데구  경상권  2473990  2456016  2431774  2466052         0.0141